from fundamental import *
from external import *


class Архитектура_как_язык_описания(Отношения_внешнего_и_внутреннего, Медиасреда, Сообщество_культура):
    Влад_Капустин = 'name'


class Архитектура_и_травма(Отношения_внешнего_и_внутреннего, Потрясение):
    Влад_Капустин = 'name'


class Новые_Онтологии(Поиск_новых_оснований):
    Влад_Капустин = 'name'


class Архитектура_как_мысленный_эксперимент(Рефлексия, Медиасреда):
    Влад_Капустин = 'name'


class Архитектура_до_реальности_архитектура_после_концепции(Отношения_внешнего_и_внутреннего, Медиасреда,
                                                            Сообщество_культура):
    Соня_Добычина = 'name'
