from fund_hierarch import Отношения_Динамичного_контекста_и_Статичной_Архитектуры, Этическое_Рефлексия_Восприятие, Критика_Понятия_Предложение_Инструмента


class Места_Сообщества(Отношения_Динамичного_контекста_и_Статичной_Архитектуры):

    def __init__(self):
        super().__init__()


class Влияние_культурных_перемен(Отношения_Динамичного_контекста_и_Статичной_Архитектуры):

    def __init__(self):
        super().__init__()


class Иррациональное(Этическое_Рефлексия_Восприятие):

    def __init__(self):
        super().__init__()


class Травма(Этическое_Рефлексия_Восприятие):

    def __init__(self):
        super().__init__()


class Медиа_Игра(Критика_Понятия_Предложение_Инструмента):

    def __init__(self):
        super().__init__()