from topics.fundamental import *
from topics.external import *
from topics.internal import *


class Архитектура_как_язык_описания(Отношения_внешнего_и_внутреннего, Медиасреда, Сообщество_культура):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_и_травма(Отношения_внешнего_и_внутреннего, Потрясение):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()


class Новые_Онтологии(Поиск_новых_оснований):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_как_мысленный_эксперимент(Рефлексия_Интерпретация_Восприятие, Медиасреда):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_до_реальности_архитектура_после_концепции(Отношения_внешнего_и_внутреннего, Медиасреда,
                                                            Сообщество_культура):
    Соня_Добычина = 'name'

    def __init__(self):
        super().__init__()


class In_Conversation(Поиск_новых_оснований, Инструменты_Методы_Для_Описания, Сообщество_культура):

    Соня_Добычина = 'name'

    def __init__(self):
        super().__init__()

class Цель_Целое_Полнота(Поиск_новых_оснований, Система):

    Сергей_Ситар = 'name'

    def __init__(self):
        super().__init__()

class Подражание_Подобие_Селекция(Противопоставление, Форма):

    Сергей_Ситар = 'name'

    def __init__(self):
        super().__init__()


class Условия_возможности_архитектуры(Субъект_Объект_Пространство, Отношения_внешнего_и_внутреннего, Система, Сообщество_культура):

    Сергей_Ситар = 'name'

    def __init__(self):
        super().__init__()

class Архитектура_нищеты_Строительный_рынок(Противопоставление, Пространство, Сообщество_культура):

    Юрий_Григорян = 'name'

    def __init__(self):
        super().__init__()


class Неуверенное_Отказ_от_авторства(Отношения_внешнего_и_внутреннего, Рефлексия_Интерпретация_Восприятие, Сообщество_культура):
    Юрий_Григорян = 'name'

    def __init__(self):
        super().__init__()


class Промт_Архитектура_как_описание(Рефлексия_Интерпретация_Восприятие, Медиасреда, Сообщество_культура):
    Юрий_Григорян = 'name'

    def __init__(self):
        super().__init__()


class Парадигма_Платформенности(Инструменты_Методы_Для_Описания, Медиасреда, Противопоставление):
    Никита_Моренов = 'name'

    def __init__(self):
        super().__init__()



class Таблетка_Годара(Инструменты_Методы_Для_Описания, Рефлексия_Интерпретация_Восприятие, Сообщество_культура):
    Никита_Моренов = 'name'

    def __init__(self):
        super().__init__()


class Ориентация_и_Навигация(Инструменты_Методы_Для_Описания, Медиасреда, Сообщество_культура):
    Никита_Моренов = 'name'

    def __init__(self):
        super().__init__()


class In_Out (Отношения_внешнего_и_внутреннего, Пространство, Сообщество_культура, Контекст):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()

class Время_как_координация (Субъект_Объект_Пространство, Пространство, Память_Время):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()

class Любовь_и_феномен_человека_в_обитании  (Субъект_Объект_Пространство, Сообщество_культура):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()