from topics.fundamental import Инструменты_Методы_Связи_С_Внешним,Поиск_новых_оснований,Исследование_Роли_Понятия_Феномена
from topics.external import *
from fund_hierarch import Отношения_Динамичного_контекста_и_Статичной_Архитектуры, Этическое_Рефлексия_Восприятие, Критика_Понятия_Предложение_Инструмента, Субъект_Объект_Пространство, Коммуникация_с_архитектурой
from topics.hierarch import Места_Сообщества, Влияние_культурных_перемен, Иррациональное, Травма, Медиа_Игра

##################################################################################################################
##################################################################################################################
##################################################################################################################


class Время_после(Места_Сообщества, Сообщество_культура, Среда_Пространство):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()


class In_Out (Влияние_культурных_перемен, Среда_Пространство, Потрясения_Травмы):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()


class Забота_Насилие (Травма, Память_Время, Сообщество_культура, Рефлексия_Переосмысление):
    Ольга_Конюкова = 'name'

    def __init__(self):
        super().__init__()


class Инаковость_России_Что_такое_невменяемость(Влияние_культурных_перемен, Сообщество_культура, Потрясения_Травмы):
    Анастасия_Яшкина = 'name'

    def __init__(self):
        super().__init__()


class Всеобщая_Урбанизация_Бездомность(Влияние_культурных_перемен, Сообщество_культура, Среда_Пространство):
    Анастасия_Яшкина = 'name'

    def __init__(self):
        super().__init__()


class Тело_в_архитектуре (Иррациональное, Сообщество_культура, Рефлексия_Переосмысление):
    Антон_Карманов = 'name'

    def __init__(self):
        super().__init__()


class Говно(Медиа_Игра, Сообщество_культура, Медиа_Дигитальное):
    Антон_Карманов = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_нищеты_Строительный_рынок(Влияние_культурных_перемен, Сообщество_культура, Среда_Пространство):
    Юрий_Григорян = 'name'

    def __init__(self):
        super().__init__()


class Некрофилия_стерильность_казенная_однотипность(Иррациональное, Потрясения_Травмы, Рефлексия_Переосмысление):
    Евгения_Репина = 'name'

    def __init__(self):
        super().__init__()


class Гео_специфичность(Влияние_культурных_перемен, Память_Время, Сообщество_культура, Рефлексия_Переосмысление):
    Николай_Смирнов = 'name'

    def __init__(self):
        super().__init__()


class Эзотерический_поворот (Иррациональное, Сообщество_культура):
    Николай_Смирнов = 'name'

    def __init__(self):
        super().__init__()


class Скандал (Медиа_Игра, Сообщество_культура, Потрясения_Травмы):
    Леша_Лашков = 'name'

    def __init__(self):
        super().__init__()


class Конкурс(Медиа_Игра, Сообщество_культура, Медиа_Дигитальное):
    Леша_Лашков = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_и_травма_картография_насилия(Травма, Влияние_культурных_перемен, Рефлексия_Переосмысление, Сообщество_культура):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()


class Архитектура_как_мысленный_эксперимент (Медиа_Игра, Рефлексия_Переосмысление, Медиа_Дигитальное ):
    Влад_Капустин = 'name'

    def __init__(self):
        super().__init__()
